dqc1_jones_polynomial.org
* DQC1 complexity class and the trace estimation problem
:PROPERTIES:
:EXPORT_LaTeX_CLASS: beamer
:EXPORT_LaTeX_CLASS_OPTIONS: [leqno,fleqn]
:EXPORT_BEAMER_THEME: PaloAlto
:EXPORT_OPTIONS: H:2
:EXPORT_LaTeX_HEADER: \input{dqc1_headers}
:EXPORT_FILE_NAME: dqc1_trace_estimation_beamer
:END:

#+author:Ohad Barta, Amitai Hoze

** The DQC1 complexity class
*** The DQC1 complexity class
DQC1 class is the class of decidable languages with algorithm $A$ such that:

-  $A$ starts with one clean qubit in state $\ket{0}$, and $n$ qubits in
   the maximally mixed state
-  $A$ may perform any unitary operation
-  $A$ can only perform a measurement of the clean qubit at the end of
   the algorithm (no middle-algorithm measurements allowed)
-  $A$ has access to a classical computer for the circuit-building purposes (or for just decide the problem, so \(P \subset DQC1\))
-  $A$ runs in polynomial time
-  $\forall x$, $A$ decides if $x \in L$ correctly with probability of
   at least $\frac{2}{3}$
*** The trace estimation problem is in DQC1
**** Trace estimation problem
Given a quantom circuit, what is the trace of its unitary operation?
*** Languages and Completness
**** Language
A Language is a finite, or an infinite set of words. $x \in L$ if the word $x$ is in this set.
**** Examples
-  $L$ is the language of all the strings that start with 0. $015 \in L$,
   but $501 \notin L$.
-  $L$ is the language of all prime numbers. $1 \in L$, $101 \in L$,
   but $15 \notin L$.
**** $L \in P$
$L$ is decidable in polynomial time, if there is some algorithm $A$ which runs in polynomial time, such that for every word $x$
it decides correctly if $x \in L$. We will say that such an algotrithm "Solves L"
*** Languages and Completness
**** Reduction
Let $L_{1}, L_{2}$ be two languages. $L_1$ is reducible to $L_2$ if there is a
function $f:L_1 \rightarrow L_2$, such that:
$f(x) \in L_{2}$ iff $x \in L_{1}$.
**** Algorithm
An algorithm for the decision problem $x \in L_{1}$ will simply check if $f(x) \in L_{2}$.
**** Example
Let $L_{1}$ be the set of all the words that start with "0", and $L_{2}$ the set of all the words that start with "1". A reduction from $L_{1}$ to $L_{2}$ will just flip the MSB of the given word.
*** Languages and Completness
**** Why languages?
We are used to discussing the complexity of a *function problem* rather than a *decision problem*, so why languages?
**** $P$ vs $FP$
- $P$ - the class of decision problems that can be computed in polynomial time
- $FP$ - the class of function problems that can be computed in polynomial time
- $P \subset FP$
- Sometimes there is a decision problem for a function problem s.t. the decision problem is in class $P$ iff the function problem is in class $P$, but not always
*** Languages and Completness
**** So why?
It's mainly for historical reasons, as Scott Aaronson says in a comment:
#+begin_quote
No, decision problems aren’t that much easier to handle, and indeed these days people talk about other types of problems (e.g., sampling and search problems) plenty often. On the other hand, when you’re comparing different complexity classes, it helps to have a uniform standard.
#+end_quote
*** The trace estimation problem is in DQC1
**** Completeness
A language L is said to be "complete" in the class DQC1, if:
- $L \in DQC1$
- $\forall L_{0} \in DQC1$ there is a reduction from $L_{0}$ to $L$, such that the reduction algorithm is in DQC1
*** The Hadamard test
:PROPERTIES:
:ID:       26221cd6-2605-47d5-ba43-b0c03df22c36
:END:
:source_table:
#+name: hadamard-test
| \lstick{\ket{0}} | \gate {H} | \ctrl{1}  | \gate {H} | \meter | \qw |
| \lstick{\psi}   | {/} \qw    | \gate {U} | {/} \qw    | \qw    | \qw |
:end:
#+begin_src latex :noweb yes
\inlineQcircuit{
  <<org-table-to-latex-matrix(hadamard-test)>>
}
#+end_src
*** The Hadamard test
We will show that this circuit indeed calculates the trace of U
**** After the first hadamard gate
\begin{align*}
   \Ket{+}\psi = \frac{1}{\sqrt{2}}\Ket{0}\Ket{\psi} + \frac{1}{\sqrt{2}}\Ket{1}\Ket{\psi}
\end{align*}
**** After the C-U operation
\begin{align*}
   \frac{1}{\sqrt{2}}\Ket{0}\Ket{\psi} + \frac{1}{\sqrt{2}}\Ket{1}U\Ket{\psi}
\end{align*}
**** After the final hadamard operation
#+begin_src latex
\begin{align*}
   \frac{1}{2}\Ket{0}\Ket{\psi} + \frac{1}{2}\Ket{1}\Ket{\psi}\ +\frac{1}{2}\Ket{0}U\Ket{\psi}\ -  \frac{1}{2}\Ket{1}U\Ket{\psi} = \\
   \frac{\Ket{\psi} + U\Ket{\psi}}{2}\Ket{0} + \frac{\Ket{\psi} - U\Ket{\psi}}{2}\Ket{1}
\end{align*}
#+end_src
*** The Hadamard test
Therefore, the propability to measure 0 at the end is:

\begin{align*}
\rho_{0} &= (\frac{\bra{\psi} + \bra{\psi}U^\dagger}{2})(\frac{\ket{\psi} + U\ket{\psi}}{2}) = \\
    &= \frac{1}{4}(\bra{\psi}\ket{\psi} + \bra{\psi}U^\dagger\ket{\psi} + \bra{\psi}U\ket{\psi} + \bra{\psi}U^\dagger U\ket{\psi}) = \\
    &= \frac{1}{2} + \frac{1}{4}(\bra{\psi}U^\dagger\ket{\psi} + \bra{\psi}U\ket{\psi}) = \\
    &=  \frac{1}{2} + \frac{1}{2}Re(\bra{\psi}U\ket{\psi})
\end{align*}
*** The Hadamard test
As $\psi$ is the completely mixed state, the probability is: \\
\begin{align*}
  \frac{1}{2^{n}}\sum_{x \in \{0,1\}^n}{\frac{1+Re(\bra{x}U\ket{x})}{2}} = \frac{1}{2} + \frac{Re(TrU)}{2^{n+1}}
\end{align*}
Therefore, the problem of trace estimation can be solved with one clean qubit.
** Completeness of trace estimation in DQC1
*** Trace estimation is in DQC1
The start state of any DQC1 problem is one clean qubit (state \(\ket{0}\)), and $n$-qubits in the maximally mixed state. That is, the start state is $\rho = \ket{0}\bra{0} \otimes \frac{I}{2^n}$. We can use the Hadamard test in order to estimate a trace of a unitary operation $U$.
*** Trace estimation is in DQC1
**** Proof
Suppose we have some language $L \in DQC1$, and some $x$, and we want to decide if $x \in L$. We apply a unitary matrix $U$ on the DQC1 start state $\rho=\ket{0}\bra{0}\frac{I}{2^n}$ and get the state $\rho_{final} = U \rho U^\dagger = U\ket{0}\bra{0}\frac{I}{2^n}U^\dagger$.
The probability to measure 0 equals to the trace of the final matrix, when we enforce the first bit to be zero, or:
\begin{align*}
 p_{0} &= Tr[(\ket{0}\bra{0}\otimes I)\rho_{final}] \\
     &= 2^{-n}Tr[(\ket{0}\bra{0} \otimes I)U(\ket{0} \bra{0} \otimes I)U^\dagger]
\end{align*}
Unfortunately - this matrix isn't unitary!!
*** Trace estimation is in DQC1
To resolve this issue, we examine the following quantom circuit C:
:source_table:
#+name: trace-estimation
|   | \qw    | \multigate{1}{U^\dag} | \ctrl{2} | \multigate{1}{U} | \ctrl{3} | \qw    |
|   | {/} \qw | \ghost{U^\dag}       | \qw      | \ghost{U}        | \qw      | {/} \qw |
|   | \qw    | \qw               | \targ    | \qw              | \qw      | \qw    |
|   | \qw    | \qw               | \qw      | \qw              | \targ    | \qw    |
:end:
#+begin_src latex :noweb yes
\inlineQcircuit{
  <<org-table-to-latex-matrix(trace-estimation)>>
}
#+end_src
**** Proposition 1
 $\frac{1}{4}Tr[C]=Tr[(\ket{0}\bra{0}\otimes I)U(\ket{0}\bra{0}\otimes I)U^\dagger]$
*** Trace estimation is in DQC1
**** 
$Tr[C] = \sum_{x \in \{0,1\}^n} \bra{x}C\ket{x}$, and in a similar way,
\begin{align*}
&Tr[(\ket{0}\bra{0} \otimes I)U(\ket{0}\bra{0} \otimes I)U^\dagger] = \\
&= \sum_{x \in \{0,1\}^n} \bra{x}(\ket{0}\bra{0}\otimes I)U(\ket{0}\bra{0}\otimes I{U^\dagger})\ket{x}
\end{align*}
**** 
Suppose that after applying $U$ on some state $\psi$, we got a non-zero component in the first qubit.
**** 
After the CNOT gate, this component will flip one of the last qubits, creating a new state that is orthogonal to $\psi$.
**** 
By the equation above, we see that in this case, this component would contribute nothing to the trace of C.
*** Trace estimation is in DQC1
**** 
On the other hand, the zero-component we get after applying $U$ on $\psi$, doesn't change the last qubit, so the contribution to the trace of C will be $\bra{\psi}(\bra{0}\ket{0} \otimes U)\ket{\psi}$
**** 
After considering the two CNOT gates, the contribution of $\psi$ to the trace of C will be $\bra{\psi}(\ket{0}\bra{0}\otimes I)U(\ket{0}\bra{0}\otimes I{U^\dagger})\ket{\psi}$
**** 
Therefore, the two circuit traces has the exact same components and are equal, up to factor of 4, which comes from the "free choice" in the values of the two last qubits in C.
*** Trace estimation is DQC1 complete
- We didn't compute the trace accurately, rather got an approximation via the expectation of the algorithm.
- According to the Chernoff inequality (which says: \(Pr[X > np +x] \leq e^{\frac{-x^{2}}{2np(1-p)}}\)), the probability of being wrong with more then $\frac{1}{n}$, is at most $O(e^{-n})$, so we can assume (with probability of almost 1), that we got a polynomial approximation to the trace.
*** Trace estimation is DQC1 complete
-  On the other hand, an approximation of $\frac{1}{poly(n)}$ to the
   expression $\frac{Tr(U)}{2^{n+1}}$ is enough to decide every problem
   in DQC1 using the analysis above
-  Therefore, we showed that getting a $\frac{2^{n}}{poly(n)}$ additive-
   approximation to the trace is a DQC1-complete problem
** Adding few more clean bits doesn't give extra power
*** Adding few more clean bits doesn't give extra power
**** DQCK
A's start state includes K clean qubits. In case that the input $x \in L$, 0 will be measured in the first clean qubit at the end of A with probability of at least $\frac{2}{3}$
*** Adding few more clean bits doesn't give extra power
We will now prove that for $k \leq \log{n}$, estimating the trace of a unitary matrix with the same precision is still a complete problem \cite{shor2008estimating}.

This proves that adding logarithmic number of clean bits doesn't change the computaional power.
Obviously we can calculate the trace of unitary matrix with $\log{n}$ bits, since we can do it just with one. 
*** Adding few more clean bits doesn't give extra power
As for the less trivial direction, assume we have some quantum algorithm in DQCK.
Similarly to the one-qubit option, final state is:
$\rho_{final} = U \rho U^\dagger = U\ket{0}\bra{0}^{\otimes k}\frac{I}{2^n}U^\dagger$
The probability of measuring 0 at the end is:
$p_{0} = Tr[(\ket{0}\bra{0} \otimes I)\rho_{final}] = 2^{-n}Tr[(\ket{0}\bra{0}\otimes I)U(\ket{0}\bra{0}^{\otimes k }\otimes I)U^\dagger$

This matrix is not unitary as well!
To resolve this, we build circuit similar to the one in the 1-clean qubit process,
but now we add additional $k-1$ ancilla qubits with a CNOT gate between the $2 \dots k$ clean qubits, and the corresponding ancilla qubits (thus enforcing them to be zero in order to contribute to the circuit's trace).
*** Adding few more clean bits doesn't give extra power
:source_table:
#+name: k-trace-estimation
| \qw | {/} \qw | \multigate{1}{U^\dag} | \ctrl{2} | \multigate{1}{U} | \ctrl{3} | {/} \qw | \qw |
| \qw | {/} \qw | \ghost{U^\dag}        | \qw      | \ghost{U}        | \qw      | {/} \qw | \qw |
| \qw | {/} \qw | \qw                | \targ    | \qw              | \qw      | {/} \qw | \qw |
| \qw | \qw    | \qw                | \qw      | \qw              | \targ    | \qw    | \qw |
:end:
#+begin_src latex :noweb yes
\inlineQcircuit{
  <<org-table-to-latex-matrix(k-trace-estimation)>>
}
#+end_src
Now, we can see (similarly to the proposition 1), that the trace of the new circuit $U^*$ follows the rule: $Tr[U^{*}] = 2^{k}Tr[U]$. Thus, in polynomial number of executions we can compute its trace up to a percision of $\frac{2^{n+k}}{poly(n,k)}$, but this equals to $\frac{2^{n}}{poly(n)}$ when $k  \leq \log{n}$, which means that in this case the precision is good enough to decide the original problem.

** References
*** References
\bibliographystyle{plain}
\bibliography{dqc1}
