dqc1_trace_estimation_beamer.tex
% Created 2015-05-28 Thu 08:13
\documentclass[leqno,fleqn]{beamer}
\tolerance=1000
\input{dqc1_headers}
\usetheme{PaloAlto}
\author{Ohad Barta, Amitai Hoze}
\date{\today}
\title{DQC1 complexity class and the trace estimation problem}
\hypersetup{
 pdfauthor={Ohad Barta, Amitai Hoze},
 pdftitle={DQC1 complexity class and the trace estimation problem},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.3.1 (Org mode 8.3beta)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}


\section{The DQC1 complexity class}
\label{sec-1}
\begin{frame}[label=sec-1-1]{The DQC1 complexity class}
DQC1 class is the class of decidable languages with algorithm \(A\) such that:

\begin{itemize}
\item \(A\) starts with one clean qubit in state \(\ket{0}\), and \(n\) qubits in
the maximally mixed state
\item \(A\) may perform any unitary operation
\item \(A\) can only perform a measurement of the clean qubit at the end of
the algorithm (no middle-algorithm measurements allowed)
\item \(A\) has access to a classical computer for the circuit-building purposes (or for just decide the problem, so \(P \subset DQC1\))
\item \(A\) runs in polynomial time
\item \(\forall x\), \(A\) decides if \(x \in L\) correctly with probability of
at least \(\frac{2}{3}\)
\end{itemize}
\end{frame}
\begin{frame}[label=sec-1-2]{The trace estimation problem is in DQC1}
\begin{block}{Trace estimation problem}
Given a quantom circuit, what is the trace of its unitary operation?
\end{block}
\end{frame}
\begin{frame}[label=sec-1-3]{Languages and Completness}
\begin{block}{Language}
A Language is a finite, or an infinite set of words. \(x \in L\) if the word \(x\) is in this set.
\end{block}
\begin{block}{Examples}
\begin{itemize}
\item \(L\) is the language of all the strings that start with 0. \(015 \in L\),
but \(501 \notin L\).
\item \(L\) is the language of all prime numbers. \(1 \in L\), \(101 \in L\),
but \(15 \notin L\).
\end{itemize}
\end{block}
\begin{block}{\(L \in P\)}
\(L\) is decidable in polynomial time, if there is some algorithm \(A\) which runs in polynomial time, such that for every word \(x\)
it decides correctly if \(x \in L\). We will say that such an algotrithm "Solves L"
\end{block}
\end{frame}
\begin{frame}[label=sec-1-4]{Languages and Completness}
\begin{block}{Reduction}
Let \(L_{1}, L_{2}\) be two languages. \(L_1\) is reducible to \(L_2\) if there is a
function \(f:L_1 \rightarrow L_2\), such that:
\(f(x) \in L_{2}\) iff \(x \in L_{1}\).
\end{block}
\begin{block}{Algorithm}
An algorithm for the decision problem \(x \in L_{1}\) will simply check if \(f(x) \in L_{2}\).
\end{block}
\begin{block}{Example}
Let \(L_{1}\) be the set of all the words that start with "0", and \(L_{2}\) the set of all the words that start with "1". A reduction from \(L_{1}\) to \(L_{2}\) will just flip the MSB of the given word.
\end{block}
\end{frame}
\begin{frame}[label=sec-1-5]{Languages and Completness}
\begin{block}{Why languages?}
We are used to discussing the complexity of a \alert{function problem} rather than a \alert{decision problem}, so why languages?
\end{block}
\begin{block}{\(P\) vs \(FP\)}
\begin{itemize}
\item \(P\) - the class of decision problems that can be computed in polynomial time
\item \(FP\) - the class of function problems that can be computed in polynomial time
\item \(P \subset FP\)
\item Sometimes there is a decision problem for a function problem s.t. the decision problem is in class \(P\) iff the function problem is in class \(P\), but not always
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[label=sec-1-6]{Languages and Completness}
\begin{block}{So why?}
It's mainly for historical reasons, as Scott Aaronson says in a comment:
\begin{quote}
No, decision problems aren’t that much easier to handle, and indeed these days people talk about other types of problems (e.g., sampling and search problems) plenty often. On the other hand, when you’re comparing different complexity classes, it helps to have a uniform standard.
\end{quote}
\end{block}
\end{frame}
\begin{frame}[label=sec-1-7]{The trace estimation problem is in DQC1}
\begin{block}{Completeness}
A language L is said to be "complete" in the class DQC1, if:
\begin{itemize}
\item \(L \in DQC1\)
\item \(\forall L_{0} \in DQC1\) there is a reduction from \(L_{0}\) to \(L\), such that the reduction algorithm is in DQC1
\end{itemize}
\end{block}
\end{frame}
\begin{frame}[label=sec-1-8]{The Hadamard test}
\inlineQcircuit{
  \lstick{\ket{0}} & \gate {H} & \ctrl{1} & \gate {H} & \meter & \qw \\
  \lstick{\psi} & {/} \qw & \gate {U} & {/} \qw & \qw & \qw \\
}
\end{frame}

\begin{frame}[label=sec-1-9]{The Hadamard test}
We will show that this circuit indeed calculates the trace of U
\begin{block}{After the first hadamard gate}
\begin{align*}
   \Ket{+}\psi = \frac{1}{\sqrt{2}}\Ket{0}\Ket{\psi} + \frac{1}{\sqrt{2}}\Ket{1}\Ket{\psi}
\end{align*}
\end{block}
\begin{block}{After the C-U operation}
\begin{align*}
   \frac{1}{\sqrt{2}}\Ket{0}\Ket{\psi} + \frac{1}{\sqrt{2}}\Ket{1}U\Ket{\psi}
\end{align*}
\end{block}
\begin{block}{After the final hadamard operation}
\begin{align*}
   \frac{1}{2}\Ket{0}\Ket{\psi} + \frac{1}{2}\Ket{1}\Ket{\psi}\ +\frac{1}{2}\Ket{0}U\Ket{\psi}\ -  \frac{1}{2}\Ket{1}U\Ket{\psi} = \\
   \frac{\Ket{\psi} + U\Ket{\psi}}{2}\Ket{0} + \frac{\Ket{\psi} - U\Ket{\psi}}{2}\Ket{1}
\end{align*}
\end{block}
\end{frame}

\begin{frame}[label=sec-1-10]{The Hadamard test}
Therefore, the propability to measure 0 at the end is:

\begin{align*}
\rho_{0} &= (\frac{\bra{\psi} + \bra{\psi}U^\dagger}{2})(\frac{\ket{\psi} + U\ket{\psi}}{2}) = \\
    &= \frac{1}{4}(\bra{\psi}\ket{\psi} + \bra{\psi}U^\dagger\ket{\psi} + \bra{\psi}U\ket{\psi} + \bra{\psi}U^\dagger U\ket{\psi}) = \\
    &= \frac{1}{2} + \frac{1}{4}(\bra{\psi}U^\dagger\ket{\psi} + \bra{\psi}U\ket{\psi}) = \\
    &=  \frac{1}{2} + \frac{1}{2}Re(\bra{\psi}U\ket{\psi})
\end{align*}
\end{frame}
\begin{frame}[label=sec-1-11]{The Hadamard test}
As \(\psi\) is the completely mixed state, the probability is: \\
\begin{align*}
  \frac{1}{2^{n}}\sum_{x \in \{0,1\}^n}{\frac{1+Re(\bra{x}U\ket{x})}{2}} = \frac{1}{2} + \frac{Re(TrU)}{2^{n+1}}
\end{align*}
Therefore, the problem of trace estimation can be solved with one clean qubit.
\end{frame}
\section{Completeness of trace estimation in DQC1}
\label{sec-2}
\begin{frame}[label=sec-2-1]{Trace estimation is in DQC1}
The start state of any DQC1 problem is one clean qubit (state \(\ket{0}\)), and \(n\)-qubits in the maximally mixed state. That is, the start state is \(\rho = \ket{0}\bra{0} \otimes \frac{I}{2^n}\). We can use the Hadamard test in order to estimate a trace of a unitary operation \(U\).
\end{frame}
\begin{frame}[label=sec-2-2]{Trace estimation is in DQC1}
\begin{block}{Proof}
Suppose we have some language \(L \in DQC1\), and some \(x\), and we want to decide if \(x \in L\). We apply a unitary matrix \(U\) on the DQC1 start state \(\rho=\ket{0}\bra{0}\frac{I}{2^n}\) and get the state \(\rho_{final} = U \rho U^\dagger = U\ket{0}\bra{0}\frac{I}{2^n}U^\dagger\).
The probability to measure 0 equals to the trace of the final matrix, when we enforce the first bit to be zero, or:
\begin{align*}
 p_{0} &= Tr[(\ket{0}\bra{0}\otimes I)\rho_{final}] \\
     &= 2^{-n}Tr[(\ket{0}\bra{0} \otimes I)U(\ket{0} \bra{0} \otimes I)U^\dagger]
\end{align*}
Unfortunately - this matrix isn't unitary!!
\end{block}
\end{frame}
\begin{frame}[label=sec-2-3]{Trace estimation is in DQC1}
To resolve this issue, we examine the following quantom circuit C:
\inlineQcircuit{
  & \qw & \multigate{1}{U^\dag} & \ctrl{2} & \multigate{1}{U} & \ctrl{3} & \qw \\
   & {/} \qw & \ghost{U^\dag} & \qw & \ghost{U} & \qw & {/} \qw \\
   & \qw & \qw & \targ & \qw & \qw & \qw \\
   & \qw & \qw & \qw & \qw & \targ & \qw \\
}

\begin{block}{Proposition 1}
\(\frac{1}{4}Tr[C]=Tr[(\ket{0}\bra{0}\otimes I)U(\ket{0}\bra{0}\otimes I)U^\dagger]\)
\end{block}
\end{frame}
\begin{frame}[label=sec-2-4]{Trace estimation is in DQC1}
\begin{block}{}
\(Tr[C] = \sum_{x \in \{0,1\}^n} \bra{x}C\ket{x}\), and in a similar way,
\begin{align*}
&Tr[(\ket{0}\bra{0} \otimes I)U(\ket{0}\bra{0} \otimes I)U^\dagger] = \\
&= \sum_{x \in \{0,1\}^n} \bra{x}(\ket{0}\bra{0}\otimes I)U(\ket{0}\bra{0}\otimes I{U^\dagger})\ket{x}
\end{align*}
\end{block}
\begin{block}{}
Suppose that after applying \(U\) on some state \(\psi\), we got a non-zero component in the first qubit.
\end{block}
\begin{block}{}
After the CNOT gate, this component will flip one of the last qubits, creating a new state that is orthogonal to \(\psi\).
\end{block}
\begin{block}{}
By the equation above, we see that in this case, this component would contribute nothing to the trace of C.
\end{block}
\end{frame}
\begin{frame}[label=sec-2-5]{Trace estimation is in DQC1}
\begin{block}{}
On the other hand, the zero-component we get after applying \(U\) on \(\psi\), doesn't change the last qubit, so the contribution to the trace of C will be \(\bra{\psi}(\bra{0}\ket{0} \otimes U)\ket{\psi}\)
\end{block}
\begin{block}{}
After considering the two CNOT gates, the contribution of \(\psi\) to the trace of C will be \(\bra{\psi}(\ket{0}\bra{0}\otimes I)U(\ket{0}\bra{0}\otimes I{U^\dagger})\ket{\psi}\)
\end{block}
\begin{block}{}
Therefore, the two circuit traces has the exact same components and are equal, up to factor of 4, which comes from the "free choice" in the values of the two last qubits in C.
\end{block}
\end{frame}
\begin{frame}[label=sec-2-6]{Trace estimation is DQC1 complete}
\begin{itemize}
\item We didn't compute the trace accurately, rather got an approximation via the expectation of the algorithm.
\item According to the Chernoff inequality (which says: \(Pr[X > np +x] \leq e^{\frac{-x^{2}}{2np(1-p)}}\)), the probability of being wrong with more then \(\frac{1}{n}\), is at most \(O(e^{-n})\), so we can assume (with probability of almost 1), that we got a polynomial approximation to the trace.
\end{itemize}
\end{frame}
\begin{frame}[label=sec-2-7]{Trace estimation is DQC1 complete}
\begin{itemize}
\item On the other hand, an approximation of \(\frac{1}{poly(n)}\) to the
expression \(\frac{Tr(U)}{2^{n+1}}\) is enough to decide every problem
in DQC1 using the analysis above
\item Therefore, we showed that getting a \(\frac{2^{n}}{poly(n)}\) additive-
approximation to the trace is a DQC1-complete problem
\end{itemize}
\end{frame}
\section{Adding few more clean bits doesn't give extra power}
\label{sec-3}
\begin{frame}[label=sec-3-1]{Adding few more clean bits doesn't give extra power}
\begin{block}{DQCK}
A's start state includes K clean qubits. In case that the input \(x \in L\), 0 will be measured in the first clean qubit at the end of A with probability of at least \(\frac{2}{3}\)
\end{block}
\end{frame}
\begin{frame}[label=sec-3-2]{Adding few more clean bits doesn't give extra power}
We will now prove that for \(k \leq \log{n}\), estimating the trace of a unitary matrix with the same precision is still a complete problem \cite{shor2008estimating}.

This proves that adding logarithmic number of clean bits doesn't change the computaional power.
Obviously we can calculate the trace of unitary matrix with \(\log{n}\) bits, since we can do it just with one. 
\end{frame}
\begin{frame}[label=sec-3-3]{Adding few more clean bits doesn't give extra power}
As for the less trivial direction, assume we have some quantum algorithm in DQCK.
Similarly to the one-qubit option, final state is:
\(\rho_{final} = U \rho U^\dagger = U\ket{0}\bra{0}^{\otimes k}\frac{I}{2^n}U^\dagger\)
The probability of measuring 0 at the end is:
\(p_{0} = Tr[(\ket{0}\bra{0} \otimes I)\rho_{final}] = 2^{-n}Tr[(\ket{0}\bra{0}\otimes I)U(\ket{0}\bra{0}^{\otimes k }\otimes I)U^\dagger\)

This matrix is not unitary as well!
To resolve this, we build circuit similar to the one in the 1-clean qubit process,
but now we add additional \(k-1\) ancilla qubits with a CNOT gate between the \(2 \dots k\) clean qubits, and the corresponding ancilla qubits (thus enforcing them to be zero in order to contribute to the circuit's trace).
\end{frame}
\begin{frame}[label=sec-3-4]{Adding few more clean bits doesn't give extra power}
\inlineQcircuit{
  \qw & {/} \qw & \multigate{1}{U^\dag} & \ctrl{2} & \multigate{1}{U} & \ctrl{3} & {/} \qw & \qw \\
  \qw & {/} \qw & \ghost{U^\dag} & \qw & \ghost{U} & \qw & {/} \qw & \qw \\
  \qw & {/} \qw & \qw & \targ & \qw & \qw & {/} \qw & \qw \\
  \qw & \qw & \qw & \qw & \qw & \targ & \qw & \qw \\
}

Now, we can see (similarly to the proposition 1), that the trace of the new circuit \(U^*\) follows the rule: \(Tr[U^{*}] = 2^{k}Tr[U]\). Thus, in polynomial number of executions we can compute its trace up to a percision of \(\frac{2^{n+k}}{poly(n,k)}\), but this equals to \(\frac{2^{n}}{poly(n)}\) when \(k  \leq \log{n}\), which means that in this case the precision is good enough to decide the original problem.
\end{frame}

\section{References}
\label{sec-4}
\begin{frame}[label=sec-4-1]{References}
\bibliographystyle{plain}
\bibliography{dqc1}
\end{frame}
\end{document}